[
    {
      "snippet": "This place has one of the best veg and non veg smoked and grilled starters, main courses, chineese and rice dishes. The platter is amazing and mouth watering. Chicken and mutton rolls, kababs are yummy. Perfect restaurant for family for lunch and dinner.",
      "source": "MouthShut.com"
    },
    {
      "snippet": "Great place to dine with family and friends. Nice ambiance and delicious food. Tawa and grilled veg and non-veg starters and tikka's, main course, chineese and desserts.",
      "source": "MouthShut.com"
    },
    {
      "snippet": "I had an excellent experience... The restaurant had good presentation and the staff were well-trained, providing great service. The prices were reasonable and the portion sizes were generous...",
      "source": "Justdial"
    },
    {
      "snippet": "I had a fantastic experience... The service was great, and they delivered the correct items in good quantity. The food was fresh and tasty...",
      "source": "Justdial"
    },
    {
      "author": "Anna K.",
      "rating": 5,
      "snippet": "Absolutely fantastic experience! The food was delicious, especially the grilled starters. Great ambiance for a family dinner.",
      "source": "Google.com"
    },
    {
      "author": "David S.",
      "rating": 5,
      "snippet": "Wonderful service and truly authentic flavors. The Tawa dishes are a must-try! We'll definitely be back soon.",
      "source": "Google.com"
    },
    {
      "author": "Maria L.",
      "rating": 4,
      "snippet": "Very nice place with tasty food and good presentation. Staff were attentive. A bit busy on Saturday, but worth the wait.",
      "source": "Google.com"
    },
    {
      "author": "Atif Shaikh",
      "rating": 5,
      "snippet": "This place has one of the best veg and non veg smoked and grilled starters, main courses, chineese and rice dishes. The platter is amazing and mouth watering. Chicken and mutton rolls, kababs are yummy. Perfect restaurant for family for lunch and dinner.",
      "source": "Google.com"
    },
    {
      "author": "Aamina Shaikh",
      "rating": 5,
      "snippet": "Great place to dine with family and friends. Nice ambiance and delicious food. Tawa and grilled veg and non-veg starters and tikka's, main course, chineese and desserts.",
      "source": "Google.com"
    },
    {
      "author": "atif",
      "rating": 5,
      "snippet": "Tasty food. Fresh food. I had a fantastic experience at Bombay Tawa and Grill! The service was great, and they delivered the correct items in good quantity.",
      "source": "Google.com"
    },
    {
      "author": "Saif Kamaal",
      "rating": 5,
      "snippet": "Tasty food. Fresh food. I had an excellent experience at BOMBAY TAWA AND GRILL. The restaurant had good presentation and the staff were well-trained, providing great service.",
      "source": "Google.com"
    },
     {
      "author": "mohd zubair lodi",
      "rating": 4,
      "snippet": "Simple restaurant serving delicious dishes. Visited twice and was not disappointed. They take time to serve the food but the staff is pretty attentive and always there at the call. My fav so far is chicken barra and makhmali tandoori and their lachcha parathas.",
      "source": "Google.com"
    }
  ]
